---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.AllLocalChangesSavedToCentral
source: html/621f9654-180b-4391-9ebc-f1894b74b3b9.htm
---
# Autodesk.Revit.DB.BasicFileInfo.AllLocalChangesSavedToCentral Property

Are all local changes saved to the central file?

## Syntax (C#)
```csharp
public bool AllLocalChangesSavedToCentral { get; }
```